var mamulZone = {
	"나무인형": "중부 라노시아",
	"못생긴 보가쟈": "중부 라노시아",
	"웅크테히": "저지 라노시아",
	"마도 지옥손아귀": "동부 라노시아",
	"난": "서부 라노시아",
	"마베리": "고지 라노시아",
	"콘누": "외지 라노시아",
	"포르네우스": "검은장막 숲 중부삼림",
	"녹아내리는 젤리": "검은장막 숲 동부삼림",
	"게데": "검은장막 숲 남부삼림",
	"기르타브": "검은장막 숲 북부삼림",
	"알렉트리온": "서부 다날란",
	"사보텐더 무희": "중부 다날란",
	"마헤스": "동부 다날란",
	"자니고": "남부 다날란",
	"마지막 투혼": "북부 다날란",
	"쿠레아": "모르도나",
	"머라쿠": "커르다스 중앙고지",
	"류바": "커르다스 서부고지",
	"미르카": "커르다스 서부고지",
	"시시우틀": "아발라시아 구름바다",
	"엔켈라도스": "아발라시아 구름바다",
	"악취화": "아지스 라",
	"캠파크티": "아지스 라",
	"스톨라스": "저지 드라바니아",
	"기계병정 슬립킨크스": "저지 드라바니아",
	"와이번 로드": "고지 드라바니아",
	"파일라스터": "고지 드라바니아",
	"부네": "드라바니아 구름바다",
	"아가토스": "드라바니아 구름바다",
	"오르쿠스": "기라바니아 변방지대",
	"얼": "기라바니아 변방지대",
	"보크스타인": "기라바니아 산악지대",
	"아크라부아멜루": "기라바니아 산악지대",
	"마히샤": "기라바니아 호반지대",
	"루미나레": "기라바니아 호반지대",
	"선박 유령": "홍옥해",
	"귀신 꿈고둥": "홍옥해",
	"가자수라": "얀샤",
	"앙가다": "얀샤",
	"기리메칼라": "아짐 대초원",
	"솜": "아짐 대초원",
	"나리폰": "레이크랜드",
	"너클라비": "레이크랜드",
	"작은 살인자": "콜루시아 섬",
	"후라칸": "콜루시아 섬",
	"말리크텐더": "아므 아랭",
	"슈가르": "아므 아랭",
	"진흙인간": "일 메그",
	"폴디아": "일 메그",
	"수파이": "라케티카 대삼림",
	"숲원인": "라케티카 대삼림",
	"루살카": "템페스트",
	"바알": "템페스트",
	"수그리바": "사베네어 섬",
	"윌란": "사베네어 섬",
	"아이게이로스": "갈레말드",
	"미네르바": "갈레말드",
	"훌드라": "라비린토스",
	"스토르시에": "라비린토스",
	"무스 공주": "비탄의 바다",
	"루나텐더 여왕": "비탄의 바다",
	"아치 에타": "울티마 툴레",
	"판 아일": "울티마 툴레",
	"페탈로두스": "엘피스",
	"구랑가치": "엘피스",

	"크로크 미테느": "중부 라노시아",
	"개굴개로스": "저지 라노시아",
	"갈록": "동부 라노시아",
	"보나콘": "서부 라노시아",
	"난디": "고지 라노시아",
	"체르노보그": "외지 라노시아",
	"레드로네트": "검은장막 숲 중부삼림",
	"울가루": "검은장막 숲 동부삼림",
	"정신지배자": "검은장막 숲 남부삼림",
	"천갈래덩굴 세다": "검은장막 숲 북부삼림",
	"조나 시커": "서부 다날란",
	"브론테스": "중부 다날란",
	"발라우르": "동부 다날란",
	"느뉴느위": "남부 다날란",
	"미뇨카온": "북부 다날란",
	"아그리파": "모르도나",
	"사파트": "커르다스 중앙고지",
	"카이저 베히모스": "커르다스 서부고지",
	"극락조": "아발라시아 구름바다",
	"레우크로타": "아지스 라",
	"창백의 기수": "저지 드라바니아",
	"센무르": "고지 드라바니아",
	"간다르바": "드라바니아 구름바다",
	"우담바라": "기라바니아 변방지대",
	"해골거미": "기라바니아 산악지대",
	"빛과 소금": "기라바니아 호반지대",
	"오키나": "홍옥해",
	"감마": "얀샤",
	"오르가나": "아짐 대초원",
	"티거": "레이크랜드",
	"면죄된 현학": "콜루시아 섬",
	"타르키아": "아므 아랭",
	"아글라오페": "일 메그",
	"이쉬타브": "라케티카 대삼림",
	"구니트": "템페스트",
	"스파티카": "사베네어 섬",
	"암스트롱": "갈레말드",
	"부푸루": "라비린토스",
	"되새기는 자": "비탄의 바다",
	"내로 리프트": "울티마 툴레",
	"오피오네우스": "엘피스",

	"베히모스": "커르다스 서부고지",
	"알테마": "아지스 라",
	"오딘": "삼림전체",
	"레기나 1단계": "고지 드라바니아",
	"레기나 2단계": "고지 드라바니아",
	"레기나 3단계": "고지 드라바니아",
	"타마모": "얀샤",
	"익시온": "기라바니아 호반지대",
	"어마무시": "콜루시아 섬",
	"아르케오타니아": "템페스트",
	"다이바디파": "사베네어 섬",
	"키": "울티마 툴레",
};

var mamulNameConvert = {
	"프로토 알테마": "알테마",
	"에테르 집적기": "알테마",
	"야광화": "알테마"
};


var inputs = $('input[type="text"]');
var googleSubmitBtn = $('#google-submit');
var snackbar = $('#snackbar');

var inputName = $('#name');
var inputAge = $('#age');
var inputArea = $('#area');

function isLoading(status) {
  if (status) {
    $('html, body').addClass('wait');
    googleSubmitBtn.attr('disabled', true).html('입력중...');
  } else {
    $('html, body').removeClass('wait');
    googleSubmitBtn.attr('disabled', false).html('입력');
  }
}

function checkInput() {
  var isEmpty = false;
  $.each(inputs, function(index, element) {
    if (element.value === '') {
      alert('빈 칸이 있어요.');
      isEmpty = true;
      return false;
    }
  });
  return isEmpty;
}

$('#google-submit').click(function() {

  //빈값 체크
  if (checkInput()) {
    return;
  }

  // 입력중..
  isLoading(true);

  $.ajax({
    type: "GET",
    url: "https://script.google.com/macros/s/AKfycbwDPbS-NLPod3G6leDWDC2LY6I-dNPrvEAIe1VMAijkxjzwl5RK6SDYDZKD_xgkcPtJ/exec",
    data: {
      "이름": inputName.val(),
      "나이": inputAge.val(),
      "사는곳": inputArea.val()
    },
    success: function(response) {
      isLoading(false);

      snackbar.html('입력이 완료됐습니다.').addClass('show');
      setTimeout(function() {
        snackbar.removeClass('show');
      }, 3000);

      //값 비워주기
      inputName.val('');
      inputAge.val('');
      inputArea.val('');
    },
    error: function(request, status, error) {
      isLoading(false);
      console.log("code:" + request.status + "\n" + "error:" + error);
      console.log(request.responseText);
    }
  });
});
